tap "arl/arl" # for gitmux

# dotfile
brew "stow"
brew "go-task/tap/go-task"

# editor
brew "emacs"
brew "vim"
brew "jq"

# shell & terminal
brew "fish"
brew "starship"
brew "devcontainer"

# database
brew "postgresql"
brew "mysql"

# git
brew "git"
brew "gh"
brew "git-delta"
brew "tig"
brew "act"

# file & directory
brew "fzf"
brew "bat"
brew "bat-extras"
brew "fd"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "zip"

# process
brew "procs"
brew "bottom"

# help
brew "man-db"
brew "navi"

# web
brew "httpie"
brew "translate-shell"
brew "wget"

# terraform
brew "tfenv"
brew "tflint"

# languages
brew "rbenv"
brew "python"

# others
brew "texinfo"
