tap "homebrew/bundle"
tap "arl/arl" # for gitmux

# dotfile
brew "stow"
brew "go-task"

# editor
# in my environment emacs is installed by apt
# brew "emacs"
brew "vim"
brew "jq"

# shell & terminal
brew "fish"
brew "starship"

# tmux
brew "tmux"
brew "gitmux"
brew "tmux-mem-cpu-load"
brew "tmuxinator"

# git
brew "git"
brew "gh"
brew "git-delta"
brew "tig"
brew "act"

# file & directory
brew "fzf"
brew "bat"
brew "bat-extras"
brew "fd"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "zip"

# process
brew "procs"
brew "bottom"

# help
brew "man-db"
brew "navi"

# web
brew "httpie"
brew "translate-shell"

# docker
brew "lazydocker"

# terraform
brew "tfenv"
brew "tflint"

# languages
brew "rbenv"

# libraries
brew "libgccjit"
brew "libxpm"
brew "libjpeg"
brew "libtiff"
brew "giflib"

# others
brew "imagemagick"
brew "asdf"
brew "texinfo"
brew "gnutls"
