tap "homebrew/bundle"
tap "arl/arl" # for gitmux

# dotfile
brew "stow"
brew "go-task"

# editor
brew "emacs"
brew "vim"
brew "jq"

# shell & terminal
brew "tmux"
brew "gitmux"
brew "fish"
brew "starship"

# git
brew "git"
brew "gh"
brew "git-delta"
brew "tig"

# file & directory
brew "fzf"
brew "bat"
brew "bat-extras"
brew "fd"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "zip"

# process
brew "procs"
brew "bottom"

# help
brew "man-db"
brew "navi"

# web
brew "httpie"
brew "translate-shell"

# docker
brew "lazydocker"

# terraform
brew "tfenv"
brew "tflint"

# others
