tap "homebrew/bundle"

brew "stow"

brew "emacs"
brew "vim"

brew "tmux"
brew "fish"

brew "git"
brew "gh"

brew "fzf"
brew "bat"
brew "ripgrep"
brew "eza"
brew "fd"

brew "jq"

brew "tfenv"
brew "tflint"
